#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rancher-mylabs/gh-action-digitalocean/runs/run-E5dRmUdyVCBohzrz

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
digitalocean_vpc.k3s_vpc: Refreshing state... [id=7a44a8ec-8bde-4d77-adef-0d390f22a9a0]
digitalocean_project.k3s_cluster: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_firewall.k3s_firewall: Refreshing state... [id=27e7a2d4-5453-45e9-ad2d-9abd7975315b]
random_password.k3s_token: Refreshing state... [id=none]
digitalocean_droplet.k3s_server[0]: Refreshing state... [id=293780348]
digitalocean_database_cluster.k3s: Refreshing state... [id=b2d94d06-762e-4894-9fb3-70c8f6cd97e5]
digitalocean_droplet.k3s_server[1]: Refreshing state... [id=293780353]
digitalocean_loadbalancer.k3s_lb: Refreshing state... [id=7fa2412a-2ac2-4fbd-a114-9b6606fe3cf7]
digitalocean_droplet.k3s_agent[2]: Refreshing state... [id=293780347]
digitalocean_droplet.k3s_agent[0]: Refreshing state... [id=293780351]
digitalocean_droplet.k3s_agent[1]: Refreshing state... [id=293780349]
digitalocean_domain.k3s_domain: Refreshing state... [id=rancher-mylabs.tech]
digitalocean_database_user.dbuser: Refreshing state... [id=b2d94d06-762e-4894-9fb3-70c8f6cd97e5/user/k3s_user]
digitalocean_database_firewall.k3s: Refreshing state... [id=b2d94d06-762e-4894-9fb3-70c8f6cd97e5-20220403160504829900000001]
digitalocean_project_resources.k3s_server_nodes[0]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_server_nodes[1]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_domain: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_external_db: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_lb: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_agent_nodes[0]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_agent_nodes[2]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_agent_nodes[1]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # digitalocean_project.k3s_cluster has changed
  ~ resource "digitalocean_project" "k3s_cluster" {
        id          = "736cb2da-bdf6-468e-8e40-8518dbc6f3e2"
        name        = "k3s-cluster"
      ~ resources   = [
          + "do:domain:rancher-mylabs.tech",
            # (7 unchanged elements hidden)
        ]
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_certificate.k3s-cert will be created
  + resource "digitalocean_certificate" "k3s-cert" {
      + domains          = [
          + "rancher-mylabs.tech",
        ]
      + id               = (known after apply)
      + name             = "k3s-certificate"
      + not_after        = (known after apply)
      + sha1_fingerprint = (known after apply)
      + state            = (known after apply)
      + type             = "lets_encrypt"
      + uuid             = (known after apply)
    }

  # digitalocean_loadbalancer.k3s_lb will be updated in-place
  ~ resource "digitalocean_loadbalancer" "k3s_lb" {
        id                               = "7fa2412a-2ac2-4fbd-a114-9b6606fe3cf7"
        name                             = "k3s-loadbalancer"
        # (13 unchanged attributes hidden)

      - forwarding_rule {
          - entry_port      = 6443 -> null
          - entry_protocol  = "https" -> null
          - target_port     = 6443 -> null
          - target_protocol = "https" -> null
          - tls_passthrough = true -> null
        }
      + forwarding_rule {
          + certificate_id   = (known after apply)
          + certificate_name = (known after apply)
          + entry_port       = 443
          + entry_protocol   = "https"
          + target_port      = 443
          + target_protocol  = "https"
          + tls_passthrough  = true
        }
      + forwarding_rule {
          + certificate_id   = (known after apply)
          + certificate_name = (known after apply)
          + entry_port       = 6443
          + entry_protocol   = "https"
          + target_port      = 6443
          + target_protocol  = "https"
          + tls_passthrough  = true
        }
      + forwarding_rule {
          + certificate_id   = (known after apply)
          + certificate_name = (known after apply)
          + entry_port       = 80
          + entry_protocol   = "http"
          + target_port      = 80
          + target_protocol  = "http"
          + tls_passthrough  = false
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "DIGITALOCEAN_TOKEN" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @ronnyardi, Action: `pull_request`*